cf/Documents/СнятиеРезерва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>СнятиеРезерва</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВнутренниеЗаказы</xr:Item>
				<xr:Item>AccumulationRegister.ИнтернетЗаказПокупателя</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
								<v8:Type>cfg:BusinessProcessRef.СборкаЗаказа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентАвтоматическойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Акция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/AccumulationRegisters/ТоварыВРезерве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезерве</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Резерв</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Documents/ВнутреннийЗаказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ВнутреннийЗаказ</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВнутренниеЗаказы</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
				<xr:Item>AccumulationRegister.РазмещениеЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.ОтгруженныеЗаказы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.СборкаЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакупитьНедостающее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РозничнаяЗаявка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиВЗакупку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРазмещенияБезЗаказа</Name>
					<Comment>Если стоит значит резервироваться будет без учета сумм и заказа (новый вид ререзрвов)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтаДляОповещения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Почта</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъедененнаяСборка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъедененнаяСборка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеВыдачиИнструмента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияВыдачиИнструмента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВнутреннегоЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размещение</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/СнятиеРезерва/Ext/ManagerModule.bsl
Процедура ИнициализироватьДополнительныеДанныеДокумента_ст_ант(Ссылка, ДополнительныеСвойства) экспорт
	Запрос = Новый Запрос(
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() +  "
				   |;
				   |ВЫБРАТЬ
	               |	СнятиеРезерваЗаказы.ДокументЗаказ
	               |ПОМЕСТИТЬ ЗаказыДляСнятия
	               |ИЗ
	               |	Документ.СнятиеРезерва.Заказы КАК СнятиеРезерваЗаказы
	               |ГДЕ
	               |	СнятиеРезерваЗаказы.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   |	&ВидДвиженияРасход КАК ВидДвижения,
				   |	&Период КАК Период,
	               |	ТоварыВРезервеОстатки.Размещение КАК Размещение,
	               |	ТоварыВРезервеОстатки.ДокументРезерва КАК ДокументРезерва,
	               |	ТоварыВРезервеОстатки.Номенклатура КАК Номенклатура,
	               |	СУММА(ТоварыВРезервеОстатки.КоличествоОстаток) КАК Количество
	               |ИЗ
	               |	ЗаказыДляСнятия КАК ЗаказыДляСнятия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезерве.Остатки КАК ТоварыВРезервеОстатки
	               |		ПО ЗаказыДляСнятия.ДокументЗаказ = ТоварыВРезервеОстатки.ДокументРезерва
				   |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыВРезервеОстатки.ДокументРезерва,
	               |	ТоварыВРезервеОстатки.Размещение,
	               |	ТоварыВРезервеОстатки.Номенклатура
				   |");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Период", Ссылка.Дата);
	Пакет = Запрос.ВыполнитьПакет();
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", КонвертацияТипов.ПолучитьСтрокуИзТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("ТоварыВРезерве", Пакет[2].Выгрузить());
	
КонецПроцедуры

Процедура ИницилизироватьДополнительныеДанныеДокумента_ст(Ссылка, ДополнительныеСвойства) экспорт
	      
	//Запрос = Новый Запрос(
	//КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() +  ";
	//
	//// ЗАКАЗЫ ДЛЯ ФИЛЬТРОВ
	//
	//|ВЫБРАТЬ	ДокументЗаказ
	//|ПОМЕСТИТЬ 	Заказы
	//|ИЗ			Документ.СнятиеРезерва.Заказы
	//|ГДЕ		Ссылка = &Ссылка
	//|;

	//// ТОВАРЫ В РЕЗЕРВЕ
	//
	//|ВЫБРАТЬ
	//
	//|	&ВидДвиженияРасход ВидДвижения, &Период Период,
	//|	Размещение, ДокументРезерва, Номенклатура,
	//|	КоличествоОстаток Количество
	//|ИЗ
	//|	РегистрНакопления.ТоварыВРезерве.Остатки(&Период, ДокументРезерва В(ВЫБРАТЬ ДокументЗаказ ИЗ Заказы))
	//|ГДЕ 
	//|	КоличествоОстаток > 0
	//|;
	//
	//// ЗАКАЗЫ ПОКУПАТЕЛЕЙ
	//
	//|ВЫБРАТЬ
	//|	&ВидДвиженияРасход ВидДвижения, &Период Период,
	//|	ЗаказПокупателя, Номенклатура, Цена, Упаковка, Размещение, ПроцентРучнойСкидки, ПроцентАвтоматическойСкидки, СтавкаНДС, Акция,
	//|	КоличествоОстаток Количество, СуммаОстаток Сумма
	//|ИЗ
	//|	РегистрНакопления.ЗаказыПокупателей.Остатки(&Период, ЗаказПокупателя В(ВЫБРАТЬ ДокументЗаказ ИЗ Заказы) И Размещение ССЫЛКА Справочник.Склады И Размещение <> &ПустойСклад)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	&ВидДвиженияПриход ВидДвижения, &Период Период,
	//|	ЗаказПокупателя, Номенклатура, Цена, Упаковка, &ПустойСклад Размещение, ПроцентРучнойСкидки, ПроцентАвтоматическойСкидки, СтавкаНДС, Акция,
	//|	КоличествоОстаток Количество, СуммаОстаток Сумма
	//|ИЗ
	//|	РегистрНакопления.ЗаказыПокупателей.Остатки(&Период, ЗаказПокупателя В(ВЫБРАТЬ ДокументЗаказ ИЗ Заказы) И Размещение ССЫЛКА Справочник.Склады И Размещение <> &ПустойСклад)
	//|;
	//
	//// ИНТЕРНЕТ ЗАКАЗЫ
	//
	//|ВЫБРАТЬ
	//|	&ВидДвиженияРасход ВидДвижения, &Период Период,
	//|	ИнтернетЗаказ, Номенклатура, Цена, Упаковка, Размещение, ПроцентРучнойСкидки, ПроцентАвтоматическойСкидки, СтавкаНДС, Акция,
	//|	КоличествоОстаток Количество, СуммаОстаток Сумма
	//|ИЗ
	//|	РегистрНакопления.ИнтернетЗаказПокупателя.Остатки(&Период, ИнтернетЗаказ В(ВЫБРАТЬ ДокументЗаказ ИЗ Заказы) И Размещение ССЫЛКА Справочник.Склады И Размещение <> &ПустойСклад)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	&ВидДвиженияПриход ВидДвижения, &Период Период,
	//|	ИнтернетЗаказ, Номенклатура, Цена, Упаковка, &ПустойСклад Размещение, ПроцентРучнойСкидки, ПроцентАвтоматическойСкидки, СтавкаНДС, Акция,
	//|	КоличествоОстаток Количество, СуммаОстаток Сумма
	//|ИЗ
	//|	РегистрНакопления.ИнтернетЗаказПокупателя.Остатки(&Период, ИнтернетЗаказ В(ВЫБРАТЬ ДокументЗаказ ИЗ Заказы) И Размещение ССЫЛКА Справочник.Склады И Размещение <> &ПустойСклад)
	//|;
	//
	//// ВНУТРЕННИЕ ЗАКАЗЫ
	//
	//|ВЫБРАТЬ
	//|	&ВидДвиженияРасход ВидДвижения, &Период Период,
	//|	Заказчик, ВнутреннийЗаказ, Номенклатура, Упаковка, Размещение,
	//|	КоличествоОстаток Количество
	//|ИЗ
	//|	РегистрНакопления.ВнутренниеЗаказы.Остатки(&Период, ВнутреннийЗаказ В(ВЫБРАТЬ ДокументЗаказ ИЗ Заказы) И Размещение ССЫЛКА Справочник.Склады И Размещение <> &ПустойСклад)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	&ВидДвиженияПриход ВидДвижения, &Период Период,
	//|	Заказчик, ВнутреннийЗаказ, Номенклатура, Упаковка, &ПустойСклад Размещение,
	//|	КоличествоОстаток Количество
	//|ИЗ
	//|	РегистрНакопления.ВнутренниеЗаказы.Остатки(&Период, ВнутреннийЗаказ В(ВЫБРАТЬ ДокументЗаказ ИЗ Заказы) И Размещение ССЫЛКА Справочник.Склады И Размещение <> &ПустойСклад)
	//|;
	//|");
	//
	//Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	//Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	////Запрос.УстановитьПараметр("ПериодНа1Назад", 	Ссылка.Дата - 1); // знаю, плохо
	//Запрос.УстановитьПараметр("ПустойСклад", 		Справочники.Склады.ПустаяСсылка());
	//Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);
	//Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	//
	//Пакет = Запрос.ВыполнитьПакет();
	//
	//ДополнительныеСвойства.Вставить("ПараметрыСистемы", 		КонвертацияТипов.ПолучитьСтрокуИзТаблицыЗначений(Пакет[0].Выгрузить()));
	//ДополнительныеСвойства.Вставить("ТоварыВРезерве", 			Пакет[2].Выгрузить());
	//ДополнительныеСвойства.Вставить("ЗаказыПокупателей", 		Пакет[3].Выгрузить());
	//ДополнительныеСвойства.Вставить("ИнтернетЗаказПокупателя", 	Пакет[4].Выгрузить());
	//ДополнительныеСвойства.Вставить("ВнутренниеЗаказы", 		Пакет[5].Выгрузить());
	
КонецПроцедуры

Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) экспорт
	      
	Запрос = Новый Запрос(
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() +  ";
	
	// ТОВАРЫ В РЕЗЕРВЕ
	
	|ВЫБРАТЬ
	|	&ВидДвиженияРасход ВидДвижения, &Период Период,
	|	Размещение, Заказ ДокументРезерва, Номенклатура,
	|	Количество
	|ИЗ
	|	Документ.СнятиеРезерва.Товары
	|ГДЕ 
	|	Ссылка = &Ссылка
	|;
	
	// ЗАКАЗЫ ПОКУПАТЕЛЕЙ
	
	|ВЫБРАТЬ
	|	&ВидДвиженияПриход ВидДвижения, &Период Период,
	|	Заказ ЗаказПокупателя, Номенклатура, Цена, Упаковка, Размещение, ПроцентРучнойСкидки, ПроцентАвтоматическойСкидки, СтавкаНДС, Акция,
	|	-Количество Количество, -Сумма Сумма
	|ИЗ
	|	Документ.СнятиеРезерва.Товары
	|ГДЕ 
	|	Ссылка = &Ссылка И Заказ ССЫЛКА Документ.ЗаказПокупателя И НЕ Заказ.СпособРазмещенияБезЗаказа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ВидДвиженияПриход ВидДвижения, &Период Период,
	|	Заказ ЗаказПокупателя, Номенклатура, Цена, Упаковка, &ПустойСклад Размещение, ПроцентРучнойСкидки, ПроцентАвтоматическойСкидки, СтавкаНДС, Акция,
	|	Количество, Сумма
	|ИЗ
	|	Документ.СнятиеРезерва.Товары
	|ГДЕ 
	|	Ссылка = &Ссылка И Заказ ССЫЛКА Документ.ЗаказПокупателя И НЕ Заказ.СпособРазмещенияБезЗаказа
	|;
	
	// ИНТЕРНЕТ ЗАКАЗЫ
	
	|ВЫБРАТЬ
	|	&ВидДвиженияПриход ВидДвижения, &Период Период,
	|	Заказ ИнтернетЗаказ, Номенклатура, Цена, Упаковка, Размещение, ПроцентРучнойСкидки, ПроцентАвтоматическойСкидки, СтавкаНДС, Акция,
	|	-Количество Количество, -Сумма Сумма
	|ИЗ
	|	Документ.СнятиеРезерва.Товары
	|ГДЕ 
	|	Ссылка = &Ссылка И Заказ ССЫЛКА Документ.ИнтернетЗаказПокупателя И НЕ Заказ.СпособРазмещенияБезЗаказа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ВидДвиженияПриход ВидДвижения, &Период Период,
	|	Заказ ИнтернетЗаказ, Номенклатура, Цена, Упаковка, &ПустойСклад Размещение, ПроцентРучнойСкидки, ПроцентАвтоматическойСкидки, СтавкаНДС, Акция,
	|	Количество, Сумма
	|ИЗ
	|	Документ.СнятиеРезерва.Товары
	|ГДЕ 
	|	Ссылка = &Ссылка И Заказ ССЫЛКА Документ.ИнтернетЗаказПокупателя И НЕ Заказ.СпособРазмещенияБезЗаказа
	|;
	
	// ВНУТРЕННИЕ ЗАКАЗЫ
	
	|ВЫБРАТЬ
	|	&ВидДвиженияПриход ВидДвижения, &Период Период,
	|	Заказчик, Заказ ВнутреннийЗаказ, Номенклатура, Упаковка, Размещение,
	|	-Количество Количество
	|ИЗ
	|	Документ.СнятиеРезерва.Товары
	|ГДЕ 
	|	Ссылка = &Ссылка И Заказ ССЫЛКА Документ.ВнутреннийЗаказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ВидДвиженияПриход ВидДвижения, &Период Период,
	|	Заказчик, Заказ ВнутреннийЗаказ, Номенклатура, Упаковка, &ПустойСклад Размещение,
	|	Количество
	|ИЗ
	|	Документ.СнятиеРезерва.Товары
	|ГДЕ 
	|	Ссылка = &Ссылка И Заказ ССЫЛКА Документ.ВнутреннийЗаказ
	|;
	|");
	
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	//Запрос.УстановитьПараметр("ПериодНа1Назад", 	Ссылка.Дата - 1); // знаю, плохо
	Запрос.УстановитьПараметр("ПустойСклад", 		Справочники.Склады.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", 		КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("ТоварыВРезерве", 			Пакет[1].Выгрузить());
	ДополнительныеСвойства.Вставить("ЗаказыПокупателей", 		Пакет[2].Выгрузить());
	ДополнительныеСвойства.Вставить("ИнтернетЗаказПокупателя", 	Пакет[3].Выгрузить());
	ДополнительныеСвойства.Вставить("ВнутренниеЗаказы", 		Пакет[4].Выгрузить());
	
КонецПроцедуры
